app/controllers/art_pieces_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
---
  def new
    @gallery = Gallery.find(params[:gallery_id])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]
INSERT INTO "art_pieces" ("title", "year", "artist", "gallery_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Snow at Argenteuil"], ["year", 1874], ["artist", "Claude Monet"], ["gallery_id", 116], ["created_at", 2018-03-08 21:36:40 UTC], ["updated_at", 2018-03-08 21:36:40 UTC]]
---
  def create
    @gallery = Gallery.find(params[:gallery_id])
    @art_piece = ArtPiece.new(art_piece_params)
    @art_piece.gallery = @gallery

    if @art_piece.save