app/controllers/galleries_controller.rb

  def create
    @gallery = Gallery.new(gallery_params)

    if @gallery.save
---
INSERT INTO "galleries" ("name", "city", "state", "zip", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "The Barnes Foundation"], ["city", "Philadelphia"], ["state", "PA"], ["zip", 19130], ["description", "Home to one of the greatest collections of impressionist paintings"]]